scripts/load/run-output-proxy-20260924.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/epd-load-test.js
        output: -

     scenarios: (100.00%) 2 scenarios, 25 max VUs, 2m15s max duration (incl. graceful stop):
              * read_heavy: Up to 20 looping VUs for 2m0s over 4 stages (gracefulRampDown: 15s, exec: readHeavy, gracefulStop: 30s)
              * write_chain: Up to 5 looping VUs for 1m40s over 4 stages (gracefulRampDown: 10s, exec: writeChain, gracefulStop: 30s)


Run           [ 100% ] setup()
read_heavy    [   0% ]
write_chain   [   0% ]

Run           [ 100% ] setup()
read_heavy    [   0% ]
write_chain   [   0% ]

Run           [ 100% ] setup()
read_heavy    [   0% ]
write_chain   [   0% ]

Run           [ 100% ] setup()
read_heavy    [   0% ]
write_chain   [   0% ]

Run           [ 100% ] setup()
read_heavy    [   0% ]
write_chain   [   0% ]

Run           [ 100% ] setup()
read_heavy    [   0% ]
write_chain   [   0% ]
docker : time="2026-09-24T11:34:38Z" level=info msg="setup: пул готов (20 ТС/водителей), очищено зависших ПЛ: 0, времен
ных учёток: 15" source=console
At line:1 char:302
+ ... tch {} } }; docker run --rm -i --add-host=host.docker.internal:host-g ...
+                 ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    + CategoryInfo          : NotSpecified: (time="2026-09-2... source=console:String) [], RemoteException
    + FullyQualifiedErrorId : NativeCommandError
 

running (0m07.0s), 00/25 VUs, 0 complete and 0 interrupted iterations
read_heavy    [   0% ] 00/20 VUs  0m00.5s/2m00.0s
write_chain   [   0% ] 0/5 VUs    0m00.5s/1m40.0s

running (0m08.0s), 00/25 VUs, 0 complete and 0 interrupted iterations
read_heavy    [   1% ] 00/20 VUs  0m01.5s/2m00.0s
write_chain   [   1% ] 0/5 VUs    0m01.5s/1m40.0s

running (0m09.0s), 00/25 VUs, 0 complete and 0 interrupted iterations
read_heavy    [   2% ] 00/20 VUs  0m02.5s/2m00.0s
write_chain   [   2% ] 0/5 VUs    0m02.5s/1m40.0s

running (0m10.0s), 00/25 VUs, 0 complete and 0 interrupted iterations
read_heavy    [   3% ] 00/20 VUs  0m03.5s/2m00.0s
write_chain   [   3% ] 0/5 VUs    0m03.5s/1m40.0s

running (0m11.0s), 01/25 VUs, 0 complete and 0 interrupted iterations
read_heavy    [   4% ] 01/20 VUs  0m04.5s/2m00.0s
write_chain   [   4% ] 0/5 VUs    0m04.5s/1m40.0s

running (0m12.0s), 01/25 VUs, 0 complete and 0 interrupted iterations
read_heavy    [   5% ] 01/20 VUs  0m05.5s/2m00.0s
write_chain   [   5% ] 0/5 VUs    0m05.5s/1m40.0s

running (0m13.0s), 01/25 VUs, 1 complete and 0 interrupted iterations
read_heavy    [   5% ] 01/20 VUs  0m06.5s/2m00.0s
write_chain   [   6% ] 0/5 VUs    0m06.5s/1m40.0s

running (0m14.0s), 01/25 VUs, 1 complete and 0 interrupted iterations
read_heavy    [   6% ] 01/20 VUs  0m07.5s/2m00.0s
write_chain   [   7% ] 0/5 VUs    0m07.5s/1m40.0s

running (0m15.0s), 03/25 VUs, 2 complete and 0 interrupted iterations
read_heavy    [   7% ] 02/20 VUs  0m08.5s/2m00.0s
write_chain   [   8% ] 1/5 VUs    0m08.5s/1m40.0s

running (0m16.0s), 03/25 VUs, 2 complete and 0 interrupted iterations
read_heavy    [   8% ] 02/20 VUs  0m09.5s/2m00.0s
write_chain   [   9% ] 1/5 VUs    0m09.5s/1m40.0s

running (0m17.0s), 03/25 VUs, 3 complete and 0 interrupted iterations
read_heavy    [   9% ] 02/20 VUs  0m10.5s/2m00.0s
write_chain   [  10% ] 1/5 VUs    0m10.5s/1m40.0s

running (0m18.0s), 03/25 VUs, 4 complete and 0 interrupted iterations
read_heavy    [  10% ] 02/20 VUs  0m11.5s/2m00.0s
write_chain   [  11% ] 1/5 VUs    0m11.5s/1m40.0s

running (0m19.0s), 04/25 VUs, 4 complete and 0 interrupted iterations
read_heavy    [  10% ] 03/20 VUs  0m12.5s/2m00.0s
write_chain   [  12% ] 1/5 VUs    0m12.5s/1m40.0s

running (0m20.0s), 04/25 VUs, 6 complete and 0 interrupted iterations
read_heavy    [  11% ] 03/20 VUs  0m13.5s/2m00.0s
write_chain   [  13% ] 1/5 VUs    0m13.5s/1m40.0s

running (0m21.0s), 04/25 VUs, 7 complete and 0 interrupted iterations
read_heavy    [  12% ] 03/20 VUs  0m14.5s/2m00.0s
write_chain   [  14% ] 1/5 VUs    0m14.5s/1m40.0s

running (0m22.0s), 05/25 VUs, 9 complete and 0 interrupted iterations
read_heavy    [  13% ] 03/20 VUs  0m15.5s/2m00.0s
write_chain   [  15% ] 2/5 VUs    0m15.5s/1m40.0s

running (0m23.0s), 06/25 VUs, 9 complete and 0 interrupted iterations
read_heavy    [  14% ] 04/20 VUs  0m16.5s/2m00.0s
write_chain   [  16% ] 2/5 VUs    0m16.5s/1m40.0s

running (0m24.0s), 06/25 VUs, 13 complete and 0 interrupted iterations
read_heavy    [  15% ] 04/20 VUs  0m17.5s/2m00.0s
write_chain   [  17% ] 2/5 VUs    0m17.5s/1m40.0s

running (0m25.0s), 06/25 VUs, 15 complete and 0 interrupted iterations
read_heavy    [  15% ] 04/20 VUs  0m18.5s/2m00.0s
write_chain   [  18% ] 2/5 VUs    0m18.5s/1m40.0s

running (0m26.0s), 06/25 VUs, 17 complete and 0 interrupted iterations
read_heavy    [  16% ] 04/20 VUs  0m19.5s/2m00.0s
write_chain   [  19% ] 2/5 VUs    0m19.5s/1m40.0s

running (0m27.0s), 07/25 VUs, 20 complete and 0 interrupted iterations
read_heavy    [  17% ] 05/20 VUs  0m20.5s/2m00.0s
write_chain   [  20% ] 2/5 VUs    0m20.5s/1m40.0s

running (0m28.0s), 07/25 VUs, 22 complete and 0 interrupted iterations
read_heavy    [  18% ] 05/20 VUs  0m21.5s/2m00.0s
write_chain   [  21% ] 2/5 VUs    0m21.5s/1m40.0s

running (0m29.0s), 07/25 VUs, 26 complete and 0 interrupted iterations
read_heavy    [  19% ] 05/20 VUs  0m22.5s/2m00.0s
write_chain   [  22% ] 2/5 VUs    0m22.5s/1m40.0s

running (0m30.0s), 08/25 VUs, 28 complete and 0 interrupted iterations
read_heavy    [  20% ] 06/20 VUs  0m23.5s/2m00.0s
write_chain   [  23% ] 2/5 VUs    0m23.5s/1m40.0s

running (0m31.0s), 08/25 VUs, 31 complete and 0 interrupted iterations
read_heavy    [  20% ] 06/20 VUs  0m24.5s/2m00.0s
write_chain   [  24% ] 2/5 VUs    0m24.5s/1m40.0s

running (0m32.0s), 09/25 VUs, 33 complete and 0 interrupted iterations
read_heavy    [  21% ] 07/20 VUs  0m25.5s/2m00.0s
write_chain   [  25% ] 2/5 VUs    0m25.5s/1m40.0s

running (0m33.0s), 09/25 VUs, 37 complete and 0 interrupted iterations
read_heavy    [  22% ] 07/20 VUs  0m26.5s/2m00.0s
write_chain   [  26% ] 2/5 VUs    0m26.5s/1m40.0s

running (0m34.0s), 09/25 VUs, 41 complete and 0 interrupted iterations
read_heavy    [  23% ] 07/20 VUs  0m27.5s/2m00.0s
write_chain   [  27% ] 2/5 VUs    0m27.5s/1m40.0s

running (0m35.0s), 10/25 VUs, 45 complete and 0 interrupted iterations
read_heavy    [  24% ] 08/20 VUs  0m28.5s/2m00.0s
write_chain   [  28% ] 2/5 VUs    0m28.5s/1m40.0s

running (0m36.0s), 10/25 VUs, 49 complete and 0 interrupted iterations
read_heavy    [  25% ] 08/20 VUs  0m29.5s/2m00.0s
write_chain   [  29% ] 2/5 VUs    0m29.5s/1m40.0s

running (0m37.0s), 10/25 VUs, 53 complete and 0 interrupted iterations
read_heavy    [  25% ] 08/20 VUs  0m30.5s/2m00.0s
write_chain   [  30% ] 2/5 VUs    0m30.5s/1m40.0s

running (0m38.0s), 11/25 VUs, 59 complete and 0 interrupted iterations
read_heavy    [  26% ] 09/20 VUs  0m31.5s/2m00.0s
write_chain   [  31% ] 2/5 VUs    0m31.5s/1m40.0s

running (0m39.0s), 11/25 VUs, 61 complete and 0 interrupted iterations
read_heavy    [  27% ] 09/20 VUs  0m32.5s/2m00.0s
write_chain   [  32% ] 2/5 VUs    0m32.5s/1m40.0s

running (0m40.0s), 12/25 VUs, 66 complete and 0 interrupted iterations
read_heavy    [  28% ] 10/20 VUs  0m33.5s/2m00.0s
write_chain   [  33% ] 2/5 VUs    0m33.5s/1m40.0s

running (0m41.0s), 12/25 VUs, 71 complete and 0 interrupted iterations
read_heavy    [  29% ] 10/20 VUs  0m34.5s/2m00.0s
write_chain   [  34% ] 2/5 VUs    0m34.5s/1m40.0s

running (0m42.0s), 13/25 VUs, 76 complete and 0 interrupted iterations
read_heavy    [  30% ] 10/20 VUs  0m35.5s/2m00.0s
write_chain   [  35% ] 3/5 VUs    0m35.5s/1m40.0s

running (0m43.0s), 14/25 VUs, 85 complete and 0 interrupted iterations
read_heavy    [  30% ] 11/20 VUs  0m36.5s/2m00.0s
write_chain   [  36% ] 3/5 VUs    0m36.5s/1m40.0s

running (0m44.0s), 14/25 VUs, 85 complete and 0 interrupted iterations
read_heavy    [  31% ] 11/20 VUs  0m37.5s/2m00.0s
write_chain   [  37% ] 3/5 VUs    0m37.5s/1m40.0s

running (0m45.0s), 14/25 VUs, 94 complete and 0 interrupted iterations
read_heavy    [  32% ] 11/20 VUs  0m38.5s/2m00.0s
write_chain   [  38% ] 3/5 VUs    0m38.5s/1m40.0s

running (0m46.0s), 15/25 VUs, 100 complete and 0 interrupted iterations
read_heavy    [  33% ] 12/20 VUs  0m39.5s/2m00.0s
write_chain   [  39% ] 3/5 VUs    0m39.5s/1m40.0s

running (0m47.0s), 15/25 VUs, 103 complete and 0 interrupted iterations
read_heavy    [  34% ] 12/20 VUs  0m40.5s/2m00.0s
write_chain   [  40% ] 3/5 VUs    0m40.5s/1m40.0s

running (0m48.0s), 16/25 VUs, 110 complete and 0 interrupted iterations
read_heavy    [  35% ] 13/20 VUs  0m41.5s/2m00.0s
write_chain   [  41% ] 3/5 VUs    0m41.5s/1m40.0s

running (0m49.0s), 16/25 VUs, 115 complete and 0 interrupted iterations
read_heavy    [  35% ] 13/20 VUs  0m42.5s/2m00.0s
write_chain   [  42% ] 3/5 VUs    0m42.5s/1m40.0s

running (0m50.0s), 16/25 VUs, 121 complete and 0 interrupted iterations
read_heavy    [  36% ] 13/20 VUs  0m43.5s/2m00.0s
write_chain   [  43% ] 3/5 VUs    0m43.5s/1m40.0s

running (0m51.0s), 17/25 VUs, 129 complete and 0 interrupted iterations
read_heavy    [  37% ] 14/20 VUs  0m44.5s/2m00.0s
write_chain   [  44% ] 3/5 VUs    0m44.5s/1m40.0s

running (0m52.0s), 17/25 VUs, 136 complete and 0 interrupted iterations
read_heavy    [  38% ] 14/20 VUs  0m45.5s/2m00.0s
write_chain   [  45% ] 3/5 VUs    0m45.5s/1m40.0s

running (0m53.0s), 17/25 VUs, 142 complete and 0 interrupted iterations
read_heavy    [  39% ] 14/20 VUs  0m46.5s/2m00.0s
write_chain   [  46% ] 3/5 VUs    0m46.5s/1m40.0s

running (0m54.0s), 18/25 VUs, 149 complete and 0 interrupted iterations
read_heavy    [  40% ] 15/20 VUs  0m47.5s/2m00.0s
write_chain   [  47% ] 3/5 VUs    0m47.5s/1m40.0s

running (0m55.0s), 18/25 VUs, 155 complete and 0 interrupted iterations
read_heavy    [  40% ] 15/20 VUs  0m48.5s/2m00.0s
write_chain   [  48% ] 3/5 VUs    0m48.5s/1m40.0s

running (0m56.0s), 19/25 VUs, 167 complete and 0 interrupted iterations
read_heavy    [  41% ] 16/20 VUs  0m49.5s/2m00.0s
write_chain   [  49% ] 3/5 VUs    0m49.5s/1m40.0s

running (0m57.0s), 19/25 VUs, 170 complete and 0 interrupted iterations
read_heavy    [  42% ] 16/20 VUs  0m50.5s/2m00.0s
write_chain   [  50% ] 3/5 VUs    0m50.5s/1m40.0s

running (0m58.0s), 19/25 VUs, 176 complete and 0 interrupted iterations
read_heavy    [  43% ] 16/20 VUs  0m51.5s/2m00.0s
write_chain   [  51% ] 3/5 VUs    0m51.5s/1m40.0s

running (0m59.0s), 20/25 VUs, 188 complete and 0 interrupted iterations
read_heavy    [  44% ] 17/20 VUs  0m52.5s/2m00.0s
write_chain   [  52% ] 3/5 VUs    0m52.5s/1m40.0s

running (1m00.0s), 20/25 VUs, 192 complete and 0 interrupted iterations
read_heavy    [  45% ] 17/20 VUs  0m53.5s/2m00.0s
write_chain   [  53% ] 3/5 VUs    0m53.5s/1m40.0s

running (1m01.0s), 20/25 VUs, 199 complete and 0 interrupted iterations
read_heavy    [  45% ] 17/20 VUs  0m54.5s/2m00.0s
write_chain   [  54% ] 3/5 VUs    0m54.5s/1m40.0s

running (1m02.0s), 22/25 VUs, 208 complete and 0 interrupted iterations
read_heavy    [  46% ] 18/20 VUs  0m55.5s/2m00.0s
write_chain   [  55% ] 4/5 VUs    0m55.5s/1m40.0s

running (1m03.0s), 22/25 VUs, 217 complete and 0 interrupted iterations
read_heavy    [  47% ] 18/20 VUs  0m56.5s/2m00.0s
write_chain   [  56% ] 4/5 VUs    0m56.5s/1m40.0s

running (1m04.0s), 23/25 VUs, 226 complete and 0 interrupted iterations
read_heavy    [  48% ] 19/20 VUs  0m57.5s/2m00.0s
write_chain   [  57% ] 4/5 VUs    0m57.5s/1m40.0s

running (1m05.0s), 23/25 VUs, 235 complete and 0 interrupted iterations
read_heavy    [  49% ] 19/20 VUs  0m58.5s/2m00.0s
write_chain   [  58% ] 4/5 VUs    0m58.5s/1m40.0s

running (1m06.0s), 23/25 VUs, 245 complete and 0 interrupted iterations
read_heavy    [  50% ] 19/20 VUs  0m59.5s/2m00.0s
write_chain   [  59% ] 4/5 VUs    0m59.5s/1m40.0s

running (1m07.0s), 24/25 VUs, 255 complete and 0 interrupted iterations
read_heavy    [  50% ] 20/20 VUs  1m00.5s/2m00.0s
write_chain   [  60% ] 4/5 VUs    1m00.5s/1m40.0s

running (1m08.0s), 24/25 VUs, 263 complete and 0 interrupted iterations
read_heavy    [  51% ] 20/20 VUs  1m01.5s/2m00.0s
write_chain   [  61% ] 4/5 VUs    1m01.5s/1m40.0s

running (1m09.0s), 24/25 VUs, 273 complete and 0 interrupted iterations
read_heavy    [  52% ] 20/20 VUs  1m02.5s/2m00.0s
write_chain   [  62% ] 4/5 VUs    1m02.5s/1m40.0s

running (1m10.0s), 24/25 VUs, 284 complete and 0 interrupted iterations
read_heavy    [  53% ] 20/20 VUs  1m03.5s/2m00.0s
write_chain   [  63% ] 4/5 VUs    1m03.5s/1m40.0s

running (1m11.0s), 24/25 VUs, 291 complete and 0 interrupted iterations
read_heavy    [  54% ] 20/20 VUs  1m04.5s/2m00.0s
write_chain   [  64% ] 4/5 VUs    1m04.5s/1m40.0s

running (1m12.0s), 24/25 VUs, 305 complete and 0 interrupted iterations
read_heavy    [  55% ] 20/20 VUs  1m05.5s/2m00.0s
write_chain   [  65% ] 4/5 VUs    1m05.5s/1m40.0s

running (1m13.0s), 24/25 VUs, 313 complete and 0 interrupted iterations
read_heavy    [  55% ] 20/20 VUs  1m06.5s/2m00.0s
write_chain   [  66% ] 4/5 VUs    1m06.5s/1m40.0s

running (1m14.0s), 24/25 VUs, 322 complete and 0 interrupted iterations
read_heavy    [  56% ] 20/20 VUs  1m07.5s/2m00.0s
write_chain   [  67% ] 4/5 VUs    1m07.5s/1m40.0s

running (1m15.0s), 24/25 VUs, 333 complete and 0 interrupted iterations
read_heavy    [  57% ] 20/20 VUs  1m08.5s/2m00.0s
write_chain   [  68% ] 4/5 VUs    1m08.5s/1m40.0s

running (1m16.0s), 24/25 VUs, 341 complete and 0 interrupted iterations
read_heavy    [  58% ] 20/20 VUs  1m09.5s/2m00.0s
write_chain   [  69% ] 4/5 VUs    1m09.5s/1m40.0s

running (1m17.0s), 24/25 VUs, 351 complete and 0 interrupted iterations
read_heavy    [  59% ] 20/20 VUs  1m10.5s/2m00.0s
write_chain   [  70% ] 4/5 VUs    1m10.5s/1m40.0s

running (1m18.0s), 24/25 VUs, 362 complete and 0 interrupted iterations
read_heavy    [  60% ] 20/20 VUs  1m11.5s/2m00.0s
write_chain   [  71% ] 4/5 VUs    1m11.5s/1m40.0s

running (1m19.0s), 24/25 VUs, 371 complete and 0 interrupted iterations
read_heavy    [  60% ] 20/20 VUs  1m12.5s/2m00.0s
write_chain   [  72% ] 4/5 VUs    1m12.5s/1m40.0s

running (1m20.0s), 24/25 VUs, 378 complete and 0 interrupted iterations
read_heavy    [  61% ] 20/20 VUs  1m13.5s/2m00.0s
write_chain   [  73% ] 4/5 VUs    1m13.5s/1m40.0s

running (1m21.0s), 24/25 VUs, 394 complete and 0 interrupted iterations
read_heavy    [  62% ] 20/20 VUs  1m14.5s/2m00.0s
write_chain   [  74% ] 4/5 VUs    1m14.5s/1m40.0s

running (1m22.0s), 25/25 VUs, 400 complete and 0 interrupted iterations
read_heavy    [  63% ] 20/20 VUs  1m15.5s/2m00.0s
write_chain   [  75% ] 5/5 VUs    1m15.5s/1m40.0s

running (1m23.0s), 25/25 VUs, 408 complete and 0 interrupted iterations
read_heavy    [  64% ] 20/20 VUs  1m16.5s/2m00.0s
write_chain   [  76% ] 5/5 VUs    1m16.5s/1m40.0s

running (1m24.0s), 25/25 VUs, 421 complete and 0 interrupted iterations
read_heavy    [  65% ] 20/20 VUs  1m17.5s/2m00.0s
write_chain   [  77% ] 5/5 VUs    1m17.5s/1m40.0s

running (1m25.0s), 25/25 VUs, 429 complete and 0 interrupted iterations
read_heavy    [  65% ] 20/20 VUs  1m18.5s/2m00.0s
write_chain   [  78% ] 5/5 VUs    1m18.5s/1m40.0s

running (1m26.0s), 25/25 VUs, 439 complete and 0 interrupted iterations
read_heavy    [  66% ] 20/20 VUs  1m19.5s/2m00.0s
write_chain   [  79% ] 5/5 VUs    1m19.5s/1m40.0s

running (1m27.0s), 25/25 VUs, 450 complete and 0 interrupted iterations
read_heavy    [  67% ] 20/20 VUs  1m20.5s/2m00.0s
write_chain   [  80% ] 5/5 VUs    1m20.5s/1m40.0s

running (1m28.0s), 25/25 VUs, 458 complete and 0 interrupted iterations
read_heavy    [  68% ] 20/20 VUs  1m21.5s/2m00.0s
write_chain   [  81% ] 5/5 VUs    1m21.5s/1m40.0s

running (1m29.0s), 25/25 VUs, 468 complete and 0 interrupted iterations
read_heavy    [  69% ] 20/20 VUs  1m22.5s/2m00.0s
write_chain   [  82% ] 5/5 VUs    1m22.5s/1m40.0s

running (1m30.0s), 25/25 VUs, 480 complete and 0 interrupted iterations
read_heavy    [  70% ] 20/20 VUs  1m23.5s/2m00.0s
write_chain   [  83% ] 5/5 VUs    1m23.5s/1m40.0s

running (1m31.0s), 25/25 VUs, 487 complete and 0 interrupted iterations
read_heavy    [  70% ] 20/20 VUs  1m24.5s/2m00.0s
write_chain   [  84% ] 5/5 VUs    1m24.5s/1m40.0s

running (1m32.0s), 25/25 VUs, 497 complete and 0 interrupted iterations
read_heavy    [  71% ] 20/20 VUs  1m25.5s/2m00.0s
write_chain   [  85% ] 5/5 VUs    1m25.5s/1m40.0s

running (1m33.0s), 25/25 VUs, 507 complete and 0 interrupted iterations
read_heavy    [  72% ] 20/20 VUs  1m26.5s/2m00.0s
write_chain   [  86% ] 5/5 VUs    1m26.5s/1m40.0s

running (1m34.0s), 25/25 VUs, 515 complete and 0 interrupted iterations
read_heavy    [  73% ] 20/20 VUs  1m27.5s/2m00.0s
write_chain   [  87% ] 5/5 VUs    1m27.5s/1m40.0s

running (1m35.0s), 25/25 VUs, 524 complete and 0 interrupted iterations
read_heavy    [  74% ] 20/20 VUs  1m28.5s/2m00.0s
write_chain   [  88% ] 5/5 VUs    1m28.5s/1m40.0s

running (1m36.0s), 25/25 VUs, 535 complete and 0 interrupted iterations
read_heavy    [  75% ] 20/20 VUs  1m29.5s/2m00.0s
write_chain   [  89% ] 5/5 VUs    1m29.5s/1m40.0s

running (1m37.0s), 25/25 VUs, 547 complete and 0 interrupted iterations
read_heavy    [  75% ] 20/20 VUs  1m30.5s/2m00.0s
write_chain   [  90% ] 5/5 VUs    1m30.5s/1m40.0s

running (1m38.0s), 25/25 VUs, 557 complete and 0 interrupted iterations
read_heavy    [  76% ] 20/20 VUs  1m31.5s/2m00.0s
write_chain   [  91% ] 5/5 VUs    1m31.5s/1m40.0s

running (1m39.0s), 25/25 VUs, 562 complete and 0 interrupted iterations
read_heavy    [  77% ] 20/20 VUs  1m32.5s/2m00.0s
write_chain   [  92% ] 5/5 VUs    1m32.5s/1m40.0s

running (1m40.0s), 24/25 VUs, 570 complete and 0 interrupted iterations
read_heavy    [  78% ] 20/20 VUs  1m33.5s/2m00.0s
write_chain   [  93% ] 4/5 VUs    1m33.5s/1m40.0s

running (1m41.0s), 23/25 VUs, 585 complete and 0 interrupted iterations
read_heavy    [  79% ] 20/20 VUs  1m34.5s/2m00.0s
write_chain   [  94% ] 3/5 VUs    1m34.5s/1m40.0s

running (1m42.0s), 23/25 VUs, 590 complete and 0 interrupted iterations
read_heavy    [  80% ] 20/20 VUs  1m35.5s/2m00.0s
write_chain   [  95% ] 3/5 VUs    1m35.5s/1m40.0s

running (1m43.0s), 23/25 VUs, 597 complete and 0 interrupted iterations
read_heavy    [  80% ] 20/20 VUs  1m36.5s/2m00.0s
write_chain   [  96% ] 3/5 VUs    1m36.5s/1m40.0s

running (1m44.0s), 23/25 VUs, 607 complete and 0 interrupted iterations
read_heavy    [  81% ] 20/20 VUs  1m37.5s/2m00.0s
write_chain   [  97% ] 3/5 VUs    1m37.5s/1m40.0s

running (1m45.0s), 23/25 VUs, 616 complete and 0 interrupted iterations
read_heavy    [  82% ] 20/20 VUs  1m38.5s/2m00.0s
write_chain   [  98% ] 3/5 VUs    1m38.5s/1m40.0s

running (1m46.0s), 22/25 VUs, 629 complete and 0 interrupted iterations
read_heavy    [  83% ] 20/20 VUs  1m39.5s/2m00.0s
write_chain   [  99% ] 2/5 VUs    1m39.5s/1m40.0s

running (1m47.0s), 22/25 VUs, 636 complete and 0 interrupted iterations
read_heavy    [  84% ] 20/20 VUs  1m40.5s/2m00.0s
write_chain ↓ [ 100% ] 2/5 VUs    1m40s

running (1m48.0s), 21/25 VUs, 647 complete and 0 interrupted iterations
read_heavy    [  85% ] 19/20 VUs  1m41.5s/2m00.0s
write_chain ↓ [ 100% ] 2/5 VUs    1m40s

running (1m49.0s), 19/25 VUs, 655 complete and 0 interrupted iterations
read_heavy    [  85% ] 19/20 VUs  1m42.5s/2m00.0s
write_chain ✓ [ 100% ] 0/5 VUs    1m40s

running (1m50.0s), 18/25 VUs, 663 complete and 0 interrupted iterations
read_heavy    [  86% ] 18/20 VUs  1m43.5s/2m00.0s
write_chain ✓ [ 100% ] 0/5 VUs    1m40s

running (1m51.0s), 18/25 VUs, 669 complete and 0 interrupted iterations
read_heavy    [  87% ] 18/20 VUs  1m44.5s/2m00.0s
write_chain ✓ [ 100% ] 0/5 VUs    1m40s

running (1m52.0s), 17/25 VUs, 677 complete and 0 interrupted iterations
read_heavy    [  88% ] 17/20 VUs  1m45.5s/2m00.0s
write_chain ✓ [ 100% ] 0/5 VUs    1m40s

running (1m53.0s), 16/25 VUs, 684 complete and 0 interrupted iterations
read_heavy    [  89% ] 16/20 VUs  1m46.5s/2m00.0s
write_chain ✓ [ 100% ] 0/5 VUs    1m40s

running (1m54.0s), 14/25 VUs, 691 complete and 0 interrupted iterations
read_heavy    [  90% ] 14/20 VUs  1m47.5s/2m00.0s
write_chain ✓ [ 100% ] 0/5 VUs    1m40s

running (1m55.0s), 13/25 VUs, 696 complete and 0 interrupted iterations
read_heavy    [  90% ] 13/20 VUs  1m48.5s/2m00.0s
write_chain ✓ [ 100% ] 0/5 VUs    1m40s

running (1m56.0s), 13/25 VUs, 703 complete and 0 interrupted iterations
read_heavy    [  91% ] 13/20 VUs  1m49.5s/2m00.0s
write_chain ✓ [ 100% ] 0/5 VUs    1m40s

running (1m57.0s), 11/25 VUs, 708 complete and 0 interrupted iterations
read_heavy    [  92% ] 11/20 VUs  1m50.5s/2m00.0s
write_chain ✓ [ 100% ] 0/5 VUs    1m40s

running (1m58.0s), 10/25 VUs, 711 complete and 0 interrupted iterations
read_heavy    [  93% ] 10/20 VUs  1m51.5s/2m00.0s
write_chain ✓ [ 100% ] 0/5 VUs    1m40s

running (1m59.0s), 09/25 VUs, 719 complete and 0 interrupted iterations
read_heavy    [  94% ] 09/20 VUs  1m52.5s/2m00.0s
write_chain ✓ [ 100% ] 0/5 VUs    1m40s

running (2m00.0s), 09/25 VUs, 722 complete and 0 interrupted iterations
read_heavy    [  95% ] 09/20 VUs  1m53.5s/2m00.0s
write_chain ✓ [ 100% ] 0/5 VUs    1m40s

running (2m01.0s), 08/25 VUs, 724 complete and 0 interrupted iterations
read_heavy    [  95% ] 08/20 VUs  1m54.5s/2m00.0s
write_chain ✓ [ 100% ] 0/5 VUs    1m40s

running (2m02.0s), 05/25 VUs, 731 complete and 0 interrupted iterations
read_heavy    [  96% ] 05/20 VUs  1m55.5s/2m00.0s
write_chain ✓ [ 100% ] 0/5 VUs    1m40s

running (2m03.0s), 05/25 VUs, 732 complete and 0 interrupted iterations
read_heavy    [  97% ] 05/20 VUs  1m56.5s/2m00.0s
write_chain ✓ [ 100% ] 0/5 VUs    1m40s

running (2m04.0s), 05/25 VUs, 734 complete and 0 interrupted iterations
read_heavy    [  98% ] 05/20 VUs  1m57.5s/2m00.0s
write_chain ✓ [ 100% ] 0/5 VUs    1m40s

running (2m05.0s), 03/25 VUs, 738 complete and 0 interrupted iterations
read_heavy    [  99% ] 03/20 VUs  1m58.5s/2m00.0s
write_chain ✓ [ 100% ] 0/5 VUs    1m40s

running (2m06.0s), 03/25 VUs, 738 complete and 0 interrupted iterations
read_heavy    [ 100% ] 03/20 VUs  1m59.5s/2m00.0s
write_chain ✓ [ 100% ] 0/5 VUs    1m40s

running (2m07.0s), 02/25 VUs, 740 complete and 0 interrupted iterations
read_heavy  ↓ [ 100% ] 02/20 VUs  2m0s
write_chain ✓ [ 100% ] 0/5 VUs    1m40s

running (2m08.0s), 01/25 VUs, 741 complete and 0 interrupted iterations
read_heavy  ↓ [ 100% ] 02/20 VUs  2m0s
write_chain ✓ [ 100% ] 0/5 VUs    1m40s

running (2m09.0s), 00/25 VUs, 742 complete and 0 interrupted iterations
read_heavy  ✓ [ 100% ] 00/20 VUs  2m0s
write_chain ✓ [ 100% ] 0/5 VUs    1m40s

running (2m10.0s), 00/25 VUs, 742 complete and 0 interrupted iterations
read_heavy  ✓ [ 100% ] 00/20 VUs  2m0s
write_chain ✓ [ 100% ] 0/5 VUs    1m40s
time="2026-09-24T11:36:41Z" level=info msg="teardown: отменено зависших ПЛ на LOAD-пуле: 0; удалено ТС: 20/20, водителе
й: 20/20, временных учёток: 15/15" source=console


  █ THRESHOLDS 

    read_error_rate
    ✓ 'rate<0.05' rate=0.00%

    read_list_duration
    ✓ 'p(95)<3000' p(95)=408.51ms

    write_chain_duration
    ✓ 'p(95)<5000' p(95)=221.5ms

    write_error_rate
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 1697    13.026676/s
    checks_succeeded...: 100.00% 1697 out of 1697
    checks_failed......: 0.00%   0 out of 1697

    ✓ GET /waybills -> 200
    ✓ GET /reports/summary -> 200
    ✓ create -> 201 DRAFT
    ✓ T1 -> 200 CREATED
    ✓ T2 -> 200 medPassed
    ✓ T3 -> 200 AWAITING_PAYMENT
    ✓ cancel -> 200

    CUSTOM
    read_error_rate................: 0.00%  0 out of 1342
    read_list_duration.............: avg=217.25ms min=5.78ms  med=230.34ms max=649.54ms p(90)=366.37ms p(95)=408.51ms
    read_requests_total............: 1342   10.301591/s
    read_summary_duration..........: avg=54.4ms   min=6.61ms  med=54.48ms  max=146.55ms p(90)=91.06ms  p(95)=101.46ms
    write_cancel_duration..........: avg=16.28ms  min=10.24ms med=14.86ms  max=52.94ms  p(90)=22.55ms  p(95)=24.37ms 
    write_chain_duration...........: avg=180.3ms  min=119ms   med=166ms    max=918ms    p(90)=208ms    p(95)=221.5ms 
    write_chain_success_total......: 71     0.545017/s
    write_create_duration..........: avg=74.42ms  min=44.15ms med=61.96ms  max=712.88ms p(90)=84.99ms  p(95)=88.56ms 
    write_error_rate...............: 0.00%  0 out of 71
    write_med_duration.............: avg=31.88ms  min=20.05ms med=28.86ms  max=61.09ms  p(90)=46.51ms  p(95)=50.92ms 
    write_t1_duration..............: avg=38.15ms  min=25.54ms med=34.9ms   max=105.48ms p(90)=50.67ms  p(95)=53.22ms 
    write_tech_duration............: avg=34.84ms  min=21.55ms med=33.57ms  max=56.75ms  p(90)=46.92ms  p(95)=52.2ms  

    HTTP
    http_req_duration..............: avg=106.67ms min=5.25ms  med=57.04ms  max=712.88ms p(90)=301.09ms p(95)=341.33ms
      { expected_response:true }...: avg=106.97ms min=5.25ms  med=56.41ms  max=712.88ms p(90)=301.6ms  p(95)=341.7ms 
    http_req_failed................: 0.77%  15 out of 1937
    http_reqs......................: 1937   14.868988/s

    EXECUTION
    iteration_duration.............: avg=2.5s     min=1.05s   med=2.44s    max=5.24s    p(90)=3.41s    p(95)=4.2s    
    iterations.....................: 742    5.695813/s
    vus............................: 0      min=0          max=25
    vus_max........................: 25     min=25         max=25

    NETWORK
    data_received..................: 1.1 GB 8.5 MB/s
    data_sent......................: 6.3 MB 49 kB/s



running (2m10.3s), 00/25 VUs, 742 complete and 0 interrupted iterations
read_heavy  ✓ [ 100% ] 00/20 VUs  2m0s
write_chain ✓ [ 100% ] 0/5 VUs    1m40s